# Pandas Notebook 2

In [2]:
import pandas as pd

### 31. Read the CSV file.

In [3]:
file_name = "employee_dataset.csv"

df = pd.read_csv(file_name)

### 32. Print the first 5 rows.

In [6]:
df_temp = df.head(5)

print(df_temp)

             Name                  Company_Name  \
0  Spencer Adkins                James and Sons
1    Julie Morton                 Nichols-James
2    Matthew Hall                     Scott Inc
3      Brad Scott  Johnston, Fleming and Tanner
4   Theresa Owens      Baker, Allen and Edwards

                        Employee_Job_Title      Employee_City  \
0                          Equities trader     New Russellton
1  Diplomatic Services operational officer  North Melissafurt
2               Regulatory affairs officer           Wardfort
3                      Production engineer     West Jamesview
4                      Production engineer          Whiteside

        Employee_Country  Employee_Salary Employment_Status  Employee_Rating
0  Palestinian Territory           321520         Full Time              3.9
1       Marshall Islands           589090         Full Time              4.3
2               Anguilla           630890         Full Time              3.1
3   Syrian Arab Republic           116400         Full Time              3.1
4               Dominica           523499         Full Time              4.8

### 33. Print the last 10 rows.

In [7]:
df_temp = df.tail(10)

print(df_temp)

                     Name                  Company_Name  \
299990      Monica Bender    Wallace, Smith and Shepard
299991  William Rodriguez                     Scott Inc
299992    Steven Thornton      Baker, Allen and Edwards
299993         Terry Hill       White, Mcclain and Cobb
299994      Kelly Bennett       White, Mcclain and Cobb
299995         Nancy Neal              Bullock-Carrillo
299996     Michele Butler  Johnston, Fleming and Tanner
299997        Lynn Wilson                 Nichols-James
299998      Lindsey Keith                 Nichols-James
299999      Karen Delgado                James and Sons

                  Employee_Job_Title      Employee_City Employee_Country  \
299990           Production engineer   New Cindychester       Bangladesh
299991                    Ergonomist          Whiteside      New Zealand
299992               Patent examiner         Aliciafort            Benin
299993  Investment banker, corporate   New Cindychester           Sweden
299994     Radiographer, therapeutic           Wardfort             Fiji
299995                   Optometrist  North Melissafurt            Samoa
299996                 Administrator         Aliciafort             Cuba
299997                 Administrator   New Cindychester          Bolivia
299998                          Make       Whitakerbury   Western Sahara
299999                       Actuary     New Russellton   United Kingdom

        Employee_Salary Employment_Status  Employee_Rating
299990           852660         Full Time              3.0
299991           214400         Full Time              1.5
299992            60240         Full Time              4.3
299993           414720            Intern              2.3
299994           182270         Full Time              3.6
299995            99670            Intern              3.3
299996           949580            Intern              2.6
299997           802830         Full Time              0.6
299998           257240         Full Time              2.4
299999           575770            Intern              3.3

### 34. Print the number of rows.

In [10]:
rows = df.shape[0]

print(rows)

300000

### 35. Print the number of columns.

In [11]:
columns = df.shape[1]

print(columns)

8

### 36. Print all column names.

In [15]:
column_names = df.columns

print(column_names)

Index(['Name', 'Company_Name', 'Employee_Job_Title', 'Employee_City',
       'Employee_Country', 'Employee_Salary', 'Employment_Status',
       'Employee_Rating'],
      dtype='object')

### 37. Print the mean of Employee_Salary.

In [57]:
df['Employee_Salary'].mean()

500224.20772666665

### 38. Print the mean of Employee_Rating.

In [56]:
df['Employee_Rating'].mean()

2.5059550000000006

### 39. Print the number of distinct Company_Name.

In [55]:
df['Company_Name'].nunique()

15

### 40. Print all the distinct Company_Name.

In [54]:
df['Company_Name'].unique()

array(['James and Sons', 'Nichols-James', 'Scott Inc',
       'Johnston, Fleming and Tanner', 'Baker, Allen and Edwards',
       'Andrade LLC', 'Matthews Inc', 'Taylor-Ramos',
       'Campos, Reynolds and Mccormick', 'White, Mcclain and Cobb',
       'Thomas-Spencer', 'Bullock-Carrillo', 'Marshall-Holloway',
       'Wallace, Smith and Shepard', 'Nelson-Li'], dtype=object)

### 41. Print the number of employees working in the company "Nichols-James".

In [53]:
(df['Company_Name'] == 'Nichols-James').sum()

19911

### 42-44. Print the maximum, minimum and median Employee_Salary.

In [52]:
df['Employee_Salary'].agg(['max', 'min', 'median'])

max       999990.0
min            0.0
median    500780.0
Name: Employee_Salary, dtype: float64

### 45-49. Print the distribution of the following columns: (the frequency of individual entries).

1. Company_Name

In [50]:
df['Company_Name'].value_counts()

Company_Name
Scott Inc                         20390
White, Mcclain and Cobb           20261
Thomas-Spencer                    20142
Nelson-Li                         20132
Taylor-Ramos                      20122
Baker, Allen and Edwards          20084
Matthews Inc                      20083
Bullock-Carrillo                  20063
Andrade LLC                       19983
Campos, Reynolds and Mccormick    19927
Nichols-James                     19911
James and Sons                    19868
Marshall-Holloway                 19859
Johnston, Fleming and Tanner      19811
Wallace, Smith and Shepard        19364
Name: count, dtype: int64

2. Employee_Job_Title

In [51]:
df['Employee_Job_Title'].value_counts()

Employee_Job_Title
Diplomatic Services operational officer                  30137
Administrator                                            15222
Garment/textile technologist                             15183
Trading standards officer                                15155
Patent examiner                                          15085
Armed forces logistics/support/administrative officer    15050
Retail merchandiser                                      15033
Energy manager                                           15033
Actuary                                                  15030
Investment banker, corporate                             15008
Ergonomist                                               15006
Production engineer                                      15003
Equities trader                                          15000
Naval architect                                          14905
Radiographer, therapeutic                                14882
Regulatory affairs officer                               14869
Optometrist                                              14838
Sales promotion account executive                        14820
Make                                                     14741
Name: count, dtype: int64

3. Employee_City

In [58]:
df['Employee_City'].value_counts()

Employee_City
North Melissafurt    30209
Kristaburgh          30204
Wardfort             30097
Ricardomouth         30052
Aliciafort           30037
New Russellton       30001
West Jamesview       29941
Whitakerbury         29854
Whiteside            29849
New Cindychester     29756
Name: count, dtype: int64

4. Employee_Country

In [59]:
df['Employee_Country'].value_counts()

Employee_Country
Congo                                                  2413
Korea                                                  2301
British Indian Ocean Territory (Chagos Archipelago)    1344
Egypt                                                  1322
Turkey                                                 1308
                                                       ...
Saint Vincent and the Grenadines                       1147
Czech Republic                                         1145
Mexico                                                 1144
Mauritania                                             1139
Ukraine                                                1133
Name: count, Length: 243, dtype: int64

5. Employment_Status

In [60]:
df['Employment_Status'].value_counts()

Employment_Status
Full Time    240010
Intern        59990
Name: count, dtype: int64

### 50. Print the company with the most number of employees.

In [67]:
df['Company_Name'].value_counts().idxmax()

'Scott Inc'

### 51. Print the number of employees in the above company.

In [68]:
df['Company_Name'].value_counts().max()

20390

### 52. Print the company with the least number of employees.

In [69]:
df['Company_Name'].value_counts().idxmin()

'Wallace, Smith and Shepard'

### 53. Print the number of employees in the above company.

In [70]:
df['Company_Name'].value_counts().min()

19364

### 54. Print the employee details with the maximum salary

In [76]:
max_salary_idx = df['Employee_Salary'].idxmax()
df.loc[max_salary_idx]

Name                          Anna Lawson
Company_Name                 Taylor-Ramos
Employee_Job_Title    Production engineer
Employee_City                 Kristaburgh
Employee_Country                  Lesotho
Employee_Salary                    999990
Employment_Status               Full Time
Employee_Rating                       4.0
Name: 70356, dtype: object

### 55. Print the employee details with the maximum rating

In [77]:
max_salary_idx = df['Employee_Rating'].idxmax()
df.loc[max_salary_idx]

Name                                Joshua Huffman
Company_Name                        James and Sons
Employee_Job_Title    Garment/textile technologist
Employee_City                       New Russellton
Employee_Country                      Cook Islands
Employee_Salary                             694760
Employment_Status                        Full Time
Employee_Rating                                5.0
Name: 124, dtype: object

### 56. Print the Company_Name with most number of employees in 'Wardfort' city.

In [89]:
wardfort_df = df[df['Employee_City'] == 'Wardfort']
wardfort_df['Company_Name'].value_counts().idxmax()

'White, Mcclain and Cobb'

### 57. Change the Data type of 'Employee_Salary' column to float.

In [93]:
df['Employee_Salary'] = df['Employee_Salary'].astype('float')
df['Employee_Salary']

0         321520.0
1         589090.0
2         630890.0
3         116400.0
4         523499.0
            ...
299995     99670.0
299996    949580.0
299997    802830.0
299998    257240.0
299999    575770.0
Name: Employee_Salary, Length: 300000, dtype: float64

### 58. Print the Employee_City with the most number of 'Production engineer'.

In [100]:
prod_engineer_df = df[df['Employee_Job_Title'] == 'Production engineer']
prod_engineer_df['Employee_City'].value_counts().idxmax()

'Aliciafort'

### 59. Print the Company_Name with the most number of Full-time Employees.

In [109]:
full_time_df = df[df['Employment_Status'] == 'Full Time']
full_time_df['Company_Name'].value_counts().idxmax()

'Scott Inc'

### 60. Print the Company_Name with the highest average 'Employee_Rating'.

In [120]:
average_ratings = df.groupby('Company_Name')['Employee_Rating'].mean()
average_ratings.idxmax()

'Matthews Inc'

### 61. Print the number of employees working in 'Ricardomouth' and 'Kristaburgh' location combined.

In [135]:
filtered_df = df[df['Employee_City'].isin(['Ricardomouth','Kristaburgh'])]
filtered_df.shape[0]

60256

### 62. Print the distinct Company_Name corresponding to the 5 highest paid employees in the dataset.

In [157]:
top_5_salaries = df.nlargest(5, 'Employee_Salary')
top_5_salaries.Company_Name.unique()

array(['Taylor-Ramos', 'White, Mcclain and Cobb', 'Thomas-Spencer',
       'Campos, Reynolds and Mccormick'], dtype=object)

### 63. Check if there are any duplicate rows in the DataFrame.

In [160]:
df[df.duplicated()]

Empty DataFrame
Columns: [Name, Company_Name, Employee_Job_Title, Employee_City, Employee_Country, Employee_Salary, Employment_Status, Employee_Rating]
Index: []

### 64. Check if any of the columns has NaN values.

In [166]:
df.isnull().sum()

Name                  0
Company_Name          0
Employee_Job_Title    0
Employee_City         0
Employee_Country      0
Employee_Salary       0
Employment_Status     0
Employee_Rating       0
dtype: int64

### 65. Print the data type of every column in the DataFrame.

In [173]:
df.dtypes

Name                   object
Company_Name           object
Employee_Job_Title     object
Employee_City          object
Employee_Country       object
Employee_Salary       float64
Employment_Status      object
Employee_Rating       float64
dtype: object

### 66. Print the Company_Name column only as a Series

In [177]:
df['Company_Name']

0                       James and Sons
1                        Nichols-James
2                            Scott Inc
3         Johnston, Fleming and Tanner
4             Baker, Allen and Edwards
                      ...
299995                Bullock-Carrillo
299996    Johnston, Fleming and Tanner
299997                   Nichols-James
299998                   Nichols-James
299999                  James and Sons
Name: Company_Name, Length: 300000, dtype: object

### 67. Print the Company_Name column only as a DataFrame

In [178]:
df[['Company_Name']]

                        Company_Name
0                     James and Sons
1                      Nichols-James
2                          Scott Inc
3       Johnston, Fleming and Tanner
4           Baker, Allen and Edwards
...                              ...
299995              Bullock-Carrillo
299996  Johnston, Fleming and Tanner
299997                 Nichols-James
299998                 Nichols-James
299999                James and Sons

[300000 rows x 1 columns]

### 68. Select the 'Employee_Job_Title' and 'Employee_City' column.

In [179]:
df[['Employee_Job_Title', 'Employee_City']]

                             Employee_Job_Title      Employee_City
0                               Equities trader     New Russellton
1       Diplomatic Services operational officer  North Melissafurt
2                    Regulatory affairs officer           Wardfort
3                           Production engineer     West Jamesview
4                           Production engineer          Whiteside
...                                         ...                ...
299995                              Optometrist  North Melissafurt
299996                            Administrator         Aliciafort
299997                            Administrator   New Cindychester
299998                                     Make       Whitakerbury
299999                                  Actuary     New Russellton

[300000 rows x 2 columns]

### 69. Print the number of employees with Employee_Rating greater than the average Employee_Rating

In [185]:
average_rating = df.Employee_Rating.mean()
rating_mask = df['Employee_Rating'] > average_rating
df[rating_mask].shape[0]

147548

### 70. Find the employee which has the maximum salary among the ones with  the minimum Employee_Rating

In [210]:
min_rating = df.Employee_Rating.min()
min_rating_df = df[df['Employee_Rating'] == min_rating]
employee_idx = min_rating_df['Employee_Salary'].idxmax()
df.loc[employee_idx]

Name                             Austin Poole
Company_Name          White, Mcclain and Cobb
Employee_Job_Title              Administrator
Employee_City                       Whiteside
Employee_Country        Saint Kitts and Nevis
Employee_Salary                      999690.0
Employment_Status                      Intern
Employee_Rating                           0.0
Name: 240878, dtype: object

### 71. Sort the DataFrame in ascending order of Employee_Salary

In [213]:
df.sort_values(by = 'Employee_Salary')

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
54531,Kristen Vasquez,"White, Mcclain and Cobb",Armed forces logistics/support/administrative ...,Wardfort,Bermuda,0.0,Full Time,3.4
205070,Courtney Singleton,"White, Mcclain and Cobb",Garment/textile technologist,New Cindychester,Ethiopia,0.0,Full Time,2.8
185700,Vanessa Wu,"Campos, Reynolds and Mccormick",Patent examiner,North Melissafurt,Zambia,10.0,Full Time,1.3
226792,Penny Meza,"Wallace, Smith and Shepard",Trading standards officer,Wardfort,Albania,10.0,Full Time,0.7
229395,Grace Smith,"Johnston, Fleming and Tanner",Trading standards officer,West Jamesview,Libyan Arab Jamahiriya,10.0,Intern,1.1
...,...,...,...,...,...,...,...,...
23536,Dennis Sexton,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,Kristaburgh,United Kingdom,999970.0,Full Time,0.9
50461,Logan Jackson,"White, Mcclain and Cobb",Ergonomist,Wardfort,Saint Helena,999980.0,Full Time,2.0
153993,Jason Jenkins,Taylor-Ramos,Sales promotion account executive,Aliciafort,Pakistan,999980.0,Full Time,2.6
51642,Richard Kennedy,Thomas-Spencer,Energy manager,Aliciafort,Cook Islands,999980.0,Full Time,2.4
70356,Anna Lawson,Taylor-Ramos,Production engineer,Kristaburgh,Lesotho,999990.0,Full Time,4.0

### 72. Sort the DataFrame in descending order of Employee_Rating

In [214]:
df.sort_values(by = 'Employee_Rating', ascending = False)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
222544,Laura Lopez,Scott Inc,Equities trader,Whiteside,British Virgin Islands,271140.0,Full Time,5.0
26453,Adriana Ferrell,"Johnston, Fleming and Tanner",Ergonomist,Aliciafort,Gabon,678800.0,Intern,5.0
141265,Russell Dorsey,"Baker, Allen and Edwards",Optometrist,Aliciafort,Morocco,816320.0,Full Time,5.0
184624,Katherine Jenkins,Matthews Inc,Make,New Cindychester,Nauru,498850.0,Full Time,5.0
70533,Brittney Greene,James and Sons,Energy manager,Ricardomouth,Bulgaria,332780.0,Full Time,5.0
...,...,...,...,...,...,...,...,...
50012,Sara King,Matthews Inc,Diplomatic Services operational officer,Whiteside,Iran,986490.0,Intern,0.0
289392,Heather Paul,Nelson-Li,Make,Wardfort,French Southern Territories,712720.0,Full Time,0.0
14752,Kathryn Goodwin,"Baker, Allen and Edwards",Energy manager,New Cindychester,Moldova,557330.0,Full Time,0.0
204854,Nina Yang,"Wallace, Smith and Shepard",Armed forces logistics/support/administrative ...,Wardfort,Swaziland,744300.0,Intern,0.0
242616,Melissa Johnston,Matthews Inc,Diplomatic Services operational officer,Whiteside,Macao,704700.0,Intern,0.0

### 73. Print the name of 100th employee after sorting on Name

In [224]:
name_sort_df = df.sort_values(by = 'Name')
name_sort_df.Name.iloc[99] #Indexed to 0

'Aaron Brown'

### 74. Print the first 5 rows of the first 5 columns.

In [226]:
df.iloc[:5, :5]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica

### 75. Print the transpose of the first 5 rows

In [227]:
df.iloc[:5].T

,0,1,2,3,4
Name,Spencer Adkins,Julie Morton,Matthew Hall,Brad Scott,Theresa Owens
Company_Name,James and Sons,Nichols-James,Scott Inc,"Johnston, Fleming and Tanner","Baker, Allen and Edwards"
Employee_Job_Title,Equities trader,Diplomatic Services operational officer,Regulatory affairs officer,Production engineer,Production engineer
Employee_City,New Russellton,North Melissafurt,Wardfort,West Jamesview,Whiteside
Employee_Country,Palestinian Territory,Marshall Islands,Anguilla,Syrian Arab Republic,Dominica
Employee_Salary,321520.0,589090.0,630890.0,116400.0,523499.0
Employment_Status,Full Time,Full Time,Full Time,Full Time,Full Time
Employee_Rating,3.9,4.3,3.1,3.1,4.8

### 76. Print the number of employees whose first name starts with the letter 'V'.

In [246]:
name_mask = df['Name'].str.startswith('V')
df[name_mask].shape[0]

3683

### 77. Print the number of employees whose last name starts with the letter 'R'.

In [244]:
mask = df['Name'].str.split().str.get(-1).str.startswith('R')
df[mask].shape[0]

20712

### 78. Select the rows 2 to 7 and the columns 3 to 7 (both included)

In [275]:
df.iloc[1:7, 2:7] # indexed to 0

,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status
1,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090.0,Full Time
2,Regulatory affairs officer,Wardfort,Anguilla,630890.0,Full Time
3,Production engineer,West Jamesview,Syrian Arab Republic,116400.0,Full Time
4,Production engineer,Whiteside,Dominica,523499.0,Full Time
5,Make,Ricardomouth,Mali,850140.0,Full Time
6,Naval architect,Wardfort,Aruba,711410.0,Full Time

### 79. Select every row after the 10th row and select all columns.

In [277]:
df.iloc[9:]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
9,Michael Edwards,"Campos, Reynolds and Mccormick",Ergonomist,New Cindychester,Lao People's Democratic Republic,516950.0,Full Time,2.3
10,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260.0,Full Time,4.9
11,Timothy Johnson,"Baker, Allen and Edwards",Regulatory affairs officer,Ricardomouth,Georgia,503610.0,Full Time,2.9
12,Tiffany Galvan,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,West Jamesview,Niger,786430.0,Intern,3.6
13,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210.0,Full Time,4.9
...,...,...,...,...,...,...,...,...
299995,Nancy Neal,Bullock-Carrillo,Optometrist,North Melissafurt,Samoa,99670.0,Intern,3.3
299996,Michele Butler,"Johnston, Fleming and Tanner",Administrator,Aliciafort,Cuba,949580.0,Intern,2.6
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830.0,Full Time,0.6
299998,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240.0,Full Time,2.4
299999,Karen Delgado,James and Sons,Actuary,New Russellton,United Kingdom,575770.0,Intern,3.3

### 80. Select every row up to the 10th row and select all columns.

In [278]:
df.iloc[0:10]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520.0,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090.0,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890.0,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400.0,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499.0,Full Time,4.8
5,Vanessa Allen,Andrade LLC,Make,Ricardomouth,Mali,850140.0,Full Time,2.6
6,Kelly Brown,Andrade LLC,Naval architect,Wardfort,Aruba,711410.0,Full Time,2.0
7,Vicki Beard,Matthews Inc,Diplomatic Services operational officer,Kristaburgh,Western Sahara,777000.0,Full Time,3.3
8,Lisa French,Taylor-Ramos,"Radiographer, therapeutic",West Jamesview,Kuwait,870580.0,Full Time,1.3
9,Michael Edwards,"Campos, Reynolds and Mccormick",Ergonomist,New Cindychester,Lao People's Democratic Republic,516950.0,Full Time,2.3

### 81. Select rows with employee rating > 4.5.

In [282]:
df[df['Employee_Rating'] > 4.5]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499.0,Full Time,4.8
10,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260.0,Full Time,4.9
13,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210.0,Full Time,4.9
14,Julie Cook,Matthews Inc,Equities trader,New Russellton,Puerto Rico,328860.0,Full Time,4.8
49,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320.0,Full Time,4.7
...,...,...,...,...,...,...,...,...
299910,Daniel Johnson,"Baker, Allen and Edwards",Energy manager,Wardfort,American Samoa,452970.0,Full Time,4.7
299952,Joshua Knight,Nichols-James,Sales promotion account executive,Wardfort,Mali,175450.0,Intern,4.9
299957,Martha Phillips,Matthews Inc,Naval architect,Wardfort,Somalia,485270.0,Full Time,4.8
299973,Doris Miller,Andrade LLC,Armed forces logistics/support/administrative ...,Wardfort,Kazakhstan,943340.0,Intern,5.0
299981,Herbert Bailey,Nichols-James,"Radiographer, therapeutic",New Cindychester,Guernsey,165550.0,Full Time,4.8

### 82. Select rows with employee rating > 4.5 and < 4.8.

In [299]:
mask = (df['Employee_Rating'] > 4.5) & (df['Employee_Rating'] < 4.8)
df[mask]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
49,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320.0,Full Time,4.7
88,Julie Richard,Bullock-Carrillo,Naval architect,Wardfort,Burundi,222850.0,Full Time,4.6
94,Natasha Harmon,Matthews Inc,"Radiographer, therapeutic",West Jamesview,Bolivia,790000.0,Full Time,4.7
119,Jason Parrish,Andrade LLC,Garment/textile technologist,Aliciafort,Cote d'Ivoire,581130.0,Full Time,4.7
129,Connie Coleman,Andrade LLC,Optometrist,Kristaburgh,Indonesia,899260.0,Full Time,4.7
...,...,...,...,...,...,...,...,...
299757,Melissa Perry,Marshall-Holloway,Trading standards officer,Whiteside,Russian Federation,712460.0,Full Time,4.7
299765,Jeremy Ramirez,Thomas-Spencer,Diplomatic Services operational officer,Ricardomouth,Netherlands,330640.0,Intern,4.6
299772,Adam Moss,"Johnston, Fleming and Tanner",Garment/textile technologist,Whiteside,Lao People's Democratic Republic,298790.0,Intern,4.6
299820,Brandi Christian,James and Sons,Make,North Melissafurt,Palestinian Territory,503370.0,Intern,4.6
299910,Daniel Johnson,"Baker, Allen and Edwards",Energy manager,Wardfort,American Samoa,452970.0,Full Time,4.7

### 83. Print the name of the company with the maximum employees having rating > 4.

In [306]:
df_temp = df[df['Employee_Rating'] > 4]
df_temp.value_counts('Company_Name').idxmax()

'Matthews Inc'

### 84. Print the rating of the employee named 'Julie Morton'.

In [316]:
df.loc[df['Name'] == 'Julie Morton', 'Employee_Rating'].values[0]

4.3

### 85. Print the last 3rd entry in the column Employee_City

In [315]:
df['Employee_City'].iloc[-3]

'New Cindychester'

### 86. Print the Employee_City column as a list

In [324]:
#list(df['Employee_City'])

### 87. Are the number of employees in 'Scott Inc' company greater than that in 'Andrade LLC'? Print True/False

In [332]:
employer_company_counts = df['Company_Name'].value_counts()
employer_company_counts['Scott Inc'] > employer_company_counts['Andrade LLC']

True

### 88. Which is the most common first name in the dataframe?

In [338]:
df.Name.str.split().str.get(0).value_counts().idxmax()

'Michael'

### 89. Which is the least common last name in the dataframe?

In [340]:
df.Name.str.split().str.get(-1).value_counts().idxmin()

'Madden'

### 90. What is the average name length?

In [351]:
print('median = ', df.Name.str.len().median())
print('mean = ', df.Name.str.len().mean())

median =  13.0
mean =  13.1079